
Функция ПолучитьCoockie(Запрос)Экспорт
	
	Результат = Новый Соответствие;
	
	Cookie = Запрос.Заголовки.Получить("Cookie");
	
	Если Cookie = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Куки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Cookie,";");
	
	Для Каждого Кук Из Куки Цикл
		мПар = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Кук, "=");
		Если мПар.Количество()>1 Тогда
			Результат.Вставить(СокрЛП(мПар[0]),мПар[1]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции	

Процедура CoockieВОтвет(Ответ, Имя, ЗначениеПеременной, Истекает, Путь) Экспорт 
	
	ДатаRFC = Формат(УниверсальноеВремя(Истекает), "Л=en; ДФ='ddd, dd MMM yyyy HH:mm:ss +0000'");
	//Ответ.Заголовки.Вставить("Set-Cookie", Имя + "="+ЗначениеПеременной + "; expires="+ДатаRFC+"; path="+Путь+"; domain="+Константы.Домен.Получить());
	Ответ.Заголовки.Вставить("Set-Cookie", Имя + "=" + ЗначениеПеременной + "; expires="+ДатаRFC+"; path="+Путь + "; SameSite=lax; httpOnly");
	
КонецПроцедуры
