

&НаКлиенте
Процедура ЗагрузитьПроект(Команда)
	ДВФ = Web1C_ОбщегоНазначенияКлиент.ПолучитьДиалогВыбораКаталога("Выберите каталог с проектом");
	ОО = Новый ОписаниеОповещения("ПослеВыбораКаталогаПроекта", ЭтотОбъект);
	ДВФ.Показать(ОО);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКаталогаПроекта(ВыбранныеФайлы, ДопПараметры) Экспорт 
	Если ВыбранныеФайлы <> Неопределено Тогда
		Каталог = ВыбранныеФайлы[0];
		ФайлКаталог = Новый Файл(Каталог);
		//Каталог = ФайлКаталог.Имя;
		ПутьКаталог = ФайлКаталог.Путь;
		СоздатьКаталоги("\" + ФайлКаталог.Имя);
		
		Файлы = НайтиФайлы(Каталог, "*.*", Истина);
		
		//для начала ищем каталоги и создаем их 
		Для каждого ТекФайл Из Файлы Цикл
			Если ТекФайл.ЭтоКаталог() Тогда
				ТекПуть = ТекФайл.ПолноеИмя;
				ТекПуть = "\" + СтрЗаменить(ТекПуть, ПутьКаталог, "");
				СоздатьКаталоги(ТекПуть);
				Сообщить(СтрШаблон("Создан каталог %1", Текпуть));
			КонецЕсли;
		КонецЦикла;
		
		//для начала ищем каталоги и создаем их 
		Для каждого ТекФайл Из Файлы Цикл
			Если ТекФайл.ЭтоФайл() Тогда
				ТекПуть = ТекФайл.ПолноеИмя;
				ТекПуть = "\" + СтрЗаменить(ТекПуть, ПутьКаталог, "");
				
				ПараметрыФайла = Новый Структура;
				ПараметрыФайла.Вставить("Адрес", "");
				ПараметрыФайла.Вставить("Путь", ТекПуть);
				ПараметрыФайла.Вставить("ИмяФайла", ТекФайл.Имя);
				ПараметрыФайла.Вставить("Расширение", ТекФайл.Расширение);
				
				Сообщить(ТекФайл.ПолноеИмя);
				АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ТекФайл.ПолноеИмя));
				ПараметрыФайла.Вставить("Адрес", АдресХранилища);
				ОО = Новый ОписаниеОповещения("ПослеПомещенияФайлаРесурса", ЭтотОбъект, ПараметрыФайла);
				ВыполнитьОбработкуОповещения(ОО, Истина);
				//Сообщить(ТекФайл.ПолноеИмя);//
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеПомещенияФайлаРесурса(Результат, ДопПараметры) Экспорт
	Если Результат Тогда
		АдресФайла = ДопПараметры.Адрес;
		Путь = ДопПараметры.Путь;
		ИмяФайла = ДопПараметры.ИмяФайла;
		Расширение = ДопПараметры.Расширение;
		
		СоздатьРесурс(АдресФайла, Путь, ИмяФайла, Расширение);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьКаталоги(Путь)
	Возврат Справочники.Web1C_Ресурсы.СоздатьКаталоги(Путь);
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьРесурс(АдресФайла, Путь, ИмяФайла, Расширение)
	Возврат Справочники.Web1C_Ресурсы.СоздатьРесурс(АдресФайла, Путь, ИмяФайла, Расширение);
КонецФункции



&НаКлиенте
Процедура ЗагрузитьНаборКартинок(Команда)
	ДВФ = Web1C_ОбщегоНазначенияКлиент.ПолучитьДиалогВыбораФайла("Выберите картинки", Web1C_ОбщегоНазначенияКлиент.ПолучитьФильтр_ВсеКартинки(), Истина);
	
	ОО = Новый ОписаниеОповещения("ПослеПомещенияФайла", ЭтотОбъект);
	НачатьПомещениеФайлов(ОО, , ДВФ, Истина, ЭтотОбъект.УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПослеПомещенияФайла(ПомещенныеФайлы, ДопПараметры) Экспорт
	Если ПомещенныеФайлы <> Неопределено Тогда
		а = 1;
		Для Каждого ТекФайл Из ПомещенныеФайлы Цикл
			Файл = Новый Файл(ТекФайл.Имя);
		КонецЦикла;
	КонецЕсли;
	
	Элементы.Список.Обновить();
КонецПроцедуры