
Функция ИмяПубликации() Экспорт 
	Результат = Константы.Web1C_ИмяПубликации.Получить();
	
	Возврат Результат;
КонецФункции

Функция ПолныйАдресПубликации() Экспорт 
	Результат = Константы.Web1C_ПолныйАдресПубликации.Получить();
	
	Возврат Результат;
КонецФункции

Функция ПолучитьПустуюСтруктуруДанныхПользователя() Экспорт 
	Результат = Новый Структура;
	
	Результат.Вставить("ОбъектАвторизации", Неопределено);
	Результат.Вставить("ИмяПользователя", Неопределено);
	//Результат.Вставить("ПВЗ", Неопределено);
	
	Возврат Результат;
КонецФункции

Функция ПолучитьМакетБлокаПоИД(ИД) Экспорт 
	Возврат Справочники.Web1C_Компоненты.ПолучитьСсылку(Новый УникальныйИдентификатор(ИД));
КонецФункции
