
&НаКлиенте
Процедура ПолучитьТокенДляВхода(Команда)
	АдресДляВхода = Web1C_Авторизация.СоздатьТокенДляВхода(Объект.Ссылка);
	
	Если не ПустаяСтрока(АдресДляВхода) Тогда
		Элементы.ВыданныеТокены.Обновить();
		//ПоказатьВводСтроки(, АдресДляВхода);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ВыданныеТокены, "ОбъектАвторизации", Объект.Ссылка, ,
			НСтр("ru = 'Выданные токены для входа в ЛК'"), Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
КонецПроцедуры
