
Функция ПолучитьДиалогВыбораФайла(Заголовок, Маска, МножественныйВыбор) Экспорт
	ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДВФ.Заголовок = Заголовок;
	ДВФ.МножественныйВыбор = МножественныйВыбор;
	ДВФ.Фильтр = Маска;
	
	Возврат ДВФ;
КонецФункции


Функция ПолучитьФильтр_ВсеКартинки() Экспорт
	Результат = "Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf*.svg)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf;*.svg|" 
				+ "Формат bmp (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle|"
				+ "Формат JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
				+ "Формат TIFF (*.tif)|*.tif|"
				+ "Формат GIF (*.gif)|*.gif|"
				+ "Формат PNG (*.png)|*.png|"
				+ "Формат icon (*.ico)|*.ico|"
				+ "Формат метафайл (*.wmf;*.emf)|*.wmf;*.emf|"
				+ "Формат векторной графики (*.svg)|*.svg|";
	
	
	Возврат Результат;
КонецФункции

Функция ПолучитьМаски_ВсеКартинки() Экспорт
	Результат = Новый массив;
	Результат.Добавить("*.bmp");
	Результат.Добавить("*.wmf");
	Результат.Добавить("*.dib");
	Результат.Добавить("*.rle");
	Результат.Добавить("*.jpg");
	Результат.Добавить("*.jpeg");
	Результат.Добавить("*.tif");
	Результат.Добавить("*.gif");
	Результат.Добавить("*.png");
	Результат.Добавить("*.ico");
	Результат.Добавить("*.emf");
	Результат.Добавить("*.svg");
	
	Возврат Результат;
КонецФункции


Функция ПолучитьФильтр_css() Экспорт
	Результат = "Файлы стилей (*.css)|*.css";
	
	
	Возврат Результат;
КонецФункции

Функция ПолучитьМаски_стили() Экспорт
	Результат = Новый массив;
	Результат.Добавить("*.css");
	
	Возврат Результат;
КонецФункции


Функция ПолучитьФильтр_js() Экспорт
	Результат = "Файлы скриптов (*.js)|*.js";
	
	
	Возврат Результат;
КонецФункции

Функция ПолучитьМаски_Скрипты() Экспорт
	Результат = Новый массив;
	Результат.Добавить("*.js");
	
	Возврат Результат;
КонецФункции


Функция ПолучитьДиалогВыбораКаталога(Заголовок) Экспорт
	ДВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДВФ.Заголовок = Заголовок;
	
	Возврат ДВФ;
КонецФункции
