
Функция ПоместитьФайлВоВременноеХранилище() Экспорт 
	ДД = Файл.Получить();
	
	Возврат ПоместитьВоВременноеХранилище(ДД);
КонецФункции

Процедура ПередЗаписью(Отказ)
	ПутьВеб = "/" + Наименование;
	
	мРодитель = Родитель;
	Если мРодитель <> Неопределено Тогда
		ПутьВеб = мРодитель.ПутьВеб + ПутьВеб;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		Если Не ДополнительныеСвойства.Свойство("Экспорт") Тогда
			ВыгруженВСетевуюПапку = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЭтоГруппа Тогда
		ПерезаписатьПодчиненныеЭлементы(Ссылка)
	КонецЕсли;
КонецПроцедуры

Процедура ПерезаписатьПодчиненныеЭлементы(Родитель)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ресурсы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Web1C_Ресурсы КАК Ресурсы
	|ГДЕ
	|	Ресурсы.Родитель = &Родитель";
	Запрос.УстановитьПараметр("Родитель", Родитель);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.Записать();
	КонецЦикла; 
	
КонецПроцедуры
