
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыгружатьИзображения = Истина;
	ВыгружатьСкрипты = Истина;
	ВыгружатьСтили = Истина;
	ВыгружатьФайлы = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьОбъектыДляЭкспорта(Команда)
	ПодобратьОбъектыДляЭкспортаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодобратьОбъектыДляЭкспортаНаСервере()
	ОбъектыДляЭкспорта.Очистить();
	Индекс = 1;
	Если ВыгружатьИзображения Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпрОбъекты.Ссылка КАК Объект
		|ИЗ
		|	Справочник.Web1C_Ресурсы КАК СпрОбъекты
		|ГДЕ
		|	НЕ СпрОбъекты.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА &ВыгружатьВсе
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ СпрОбъекты.ВыгруженВСетевуюПапку = ЛОЖЬ
		|		КОНЕЦ
		|	И СпрОбъекты.ВидРесурса = &ВидРесурса";
		Запрос.УстановитьПараметр("ВыгружатьВсе", ВыгружатьВсе);
		Запрос.УстановитьПараметр("ВидРесурса", ПредопределенноеЗначение("Перечисление.Web1C_ВидыРесурса.Изображение"));
		РезультатЗапроса = Запрос.Выполнить();
		
		НастройкаЭкспорта = Web1C_УправлениеКонтентом.ПолучитьНастройкиЭкспортаОбъекта(ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Изображения"));
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ОбъектыДляЭкспорта.Добавить();
			НоваяСтрока.НомерСтроки = Индекс;
			НоваяСтрока.Объект = Выборка.Объект;
			НоваяСтрока.ПутьВыгрузки = НастройкаЭкспорта.Сетевойкаталог;
			НоваяСтрока.Тип = 0;
			
			Индекс = Индекс + 1;
		КонецЦикла; 
	КонецЕсли;
	
	Если ВыгружатьФайлы Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпрОбъекты.Ссылка КАК Объект
		|ИЗ
		|	Справочник.Web1C_Ресурсы КАК СпрОбъекты
		|ГДЕ
		|	НЕ СпрОбъекты.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА &ВыгружатьВсе
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ СпрОбъекты.ВыгруженВСетевуюПапку = ЛОЖЬ
		|		КОНЕЦ
		|	И СпрОбъекты.ВидРесурса = &ВидРесурса";
		Запрос.УстановитьПараметр("ВыгружатьВсе", ВыгружатьВсе);
		Запрос.УстановитьПараметр("ВидРесурса", ПредопределенноеЗначение("Перечисление.Web1C_ВидыРесурса.Файл"));
		РезультатЗапроса = Запрос.Выполнить();
		
		НастройкаЭкспорта = Web1C_УправлениеКонтентом.ПолучитьНастройкиЭкспортаОбъекта(ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Файлы"));
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ОбъектыДляЭкспорта.Добавить();
			НоваяСтрока.НомерСтроки = Индекс;
			НоваяСтрока.Объект = Выборка.Объект;
			НоваяСтрока.ПутьВыгрузки = НастройкаЭкспорта.Сетевойкаталог;
			НоваяСтрока.Тип = 1;
			
			Индекс = Индекс + 1;
		КонецЦикла; 
	КонецЕсли;
	
	Если ВыгружатьСкрипты Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпрОбъекты.Ссылка КАК Объект
		|ИЗ
		|	Справочник.Web1C_Ресурсы КАК СпрОбъекты
		|ГДЕ
		|	НЕ СпрОбъекты.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА &ВыгружатьВсе
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ СпрОбъекты.ВыгруженВСетевуюПапку = ЛОЖЬ
		|		КОНЕЦ
		|	И СпрОбъекты.ВидРесурса = &ВидРесурса";
		Запрос.УстановитьПараметр("ВыгружатьВсе", ВыгружатьВсе);
		Запрос.УстановитьПараметр("ВидРесурса", ПредопределенноеЗначение("Перечисление.Web1C_ВидыРесурса.Скрипт"));
		РезультатЗапроса = Запрос.Выполнить();
		
		НастройкаЭкспорта = Web1C_УправлениеКонтентом.ПолучитьНастройкиЭкспортаОбъекта(ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Скрипты"));
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ОбъектыДляЭкспорта.Добавить();
			НоваяСтрока.НомерСтроки = Индекс;
			НоваяСтрока.Объект = Выборка.Объект;
			НоваяСтрока.ПутьВыгрузки = НастройкаЭкспорта.Сетевойкаталог;
			НоваяСтрока.Тип = 2;
			
			Индекс = Индекс + 1;
		КонецЦикла; 
	КонецЕсли;
	
	Если ВыгружатьСтили Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпрОбъекты.Ссылка КАК Объект
		|ИЗ
		|	Справочник.Web1C_Ресурсы КАК СпрОбъекты
		|ГДЕ
		|	НЕ СпрОбъекты.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА &ВыгружатьВсе
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ СпрОбъекты.ВыгруженВСетевуюПапку = ЛОЖЬ
		|		КОНЕЦ
		|	И СпрОбъекты.ВидРесурса = &ВидРесурса";
		Запрос.УстановитьПараметр("ВыгружатьВсе", ВыгружатьВсе);
		Запрос.УстановитьПараметр("ВидРесурса", ПредопределенноеЗначение("Перечисление.Web1C_ВидыРесурса.Стиль"));
		РезультатЗапроса = Запрос.Выполнить();
		
		НастройкаЭкспорта = Web1C_УправлениеКонтентом.ПолучитьНастройкиЭкспортаОбъекта(ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Стили"));
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ОбъектыДляЭкспорта.Добавить();
			НоваяСтрока.НомерСтроки = Индекс;
			НоваяСтрока.Объект = Выборка.Объект;
			НоваяСтрока.ПутьВыгрузки = НастройкаЭкспорта.Сетевойкаталог;
			НоваяСтрока.Тип = 3;
			
			Индекс = Индекс + 1;
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортФайловКоманда(Команда)
	ЭкспортФайлов();
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортФайлов()
	Для каждого ТекСтрока Из ОбъектыДляЭкспорта Цикл
		Если ТекСтрока.Тип = 0 Тогда
			ТекстОшибки = "";
			ТекСтрока.Выгружен = Web1C_УправлениеКонтентомКлиент.ЭкспортИзображенияВлокальныйКаталог(ТекСтрока.Объект, ТекстОшибки, ТекСтрока.ПутьВыгрузки);
			
			Если Не ТекСтрока.Выгружен Тогда
				Сообщить(ТекстОшибки);
			КонецЕсли; 
		ИначеЕсли ТекСтрока.Тип = 1 Тогда
			ТекстОшибки = "";
			ТекСтрока.Выгружен = Web1C_УправлениеКонтентомКлиент.ЭкспортФайлаВлокальныйКаталог(ТекСтрока.Объект, ТекстОшибки, ТекСтрока.ПутьВыгрузки);
			
			Если Не ТекСтрока.Выгружен Тогда
				Сообщить(ТекстОшибки);
			КонецЕсли; 
		ИначеЕсли ТекСтрока.Тип = 2 Тогда
			ТекстОшибки = "";
			ТекСтрока.Выгружен = Web1C_УправлениеКонтентомКлиент.ЭкспортСкриптаВлокальныйКаталог(ТекСтрока.Объект, ТекстОшибки, ТекСтрока.ПутьВыгрузки);
			
			Если Не ТекСтрока.Выгружен Тогда
				Сообщить(ТекстОшибки);
			КонецЕсли; 
		ИначеЕсли ТекСтрока.Тип = 3 Тогда
			ТекстОшибки = "";
			ТекСтрока.Выгружен = Web1C_УправлениеКонтентомКлиент.ЭкспортСтиляВлокальныйКаталог(ТекСтрока.Объект, ТекстОшибки, ТекСтрока.ПутьВыгрузки);
			
			Если Не ТекСтрока.Выгружен Тогда
				Сообщить(ТекстОшибки);
			КонецЕсли; 
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры
