
Функция НачальнаяСтраницаGet(Запрос)
	Возврат Web1C_ОбработчикиHTTPЗапросов.НачальнаяСтраницаGet(Запрос);
КонецФункции

Функция ДействиеPOST(Запрос)
	Возврат Web1C_ОбработчикиHTTPЗапросов.ДействиеPOST(Запрос);
КонецФункции

Функция ДействиеGET(Запрос)
	Возврат Web1C_ОбработчикиHTTPЗапросов.ДействиеGET(Запрос);
КонецФункции

Функция ВходПоТокенуGET(Запрос)
	Возврат Web1C_ОбработчикиHTTPЗапросов.ВходПоТокенуGET(Запрос);
КонецФункции

Функция APIPOST(Запрос)
	Возврат Web1C_ОбработчикиHTTPЗапросов.APIPOST(Запрос);
КонецФункции

Функция APIGET(Запрос)
	Возврат Web1C_ОбработчикиHTTPЗапросов.APIGET(Запрос);
КонецФункции

Функция ПечатьGET(Запрос)
	Возврат Web1C_ОбработчикиHTTPЗапросов.ПечатьGET(Запрос);
КонецФункции

Функция ОтчетыGET(Запрос)
	Возврат Web1C_ОбработчикиHTTPЗапросов.ОтчетыGET(Запрос);
КонецФункции

Функция ПечатьОтчетаPOST(Запрос)
	Возврат Web1C_ОбработчикиHTTPЗапросов.ПечатьОтчетаPOST(Запрос);
КонецФункции
