
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ВыполнитьИсточник(ИсточникДанных, ВыполнитьКакПакет = Ложь) Экспорт 
	Результат = Неопределено;
	
	ИсточникОб = ИсточникДанных.ПолучитьОбъект();
	Если Ложь Тогда
		ИсточникОб = Справочники.Web1C_ИсточникДанных.СоздатьЭлемент()
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ИсточникОб.ТекстЗапроса;
	
	Для каждого Параметр Из ИсточникОб.Параметры Цикл
		Если ПустаяСтрока(Параметр.Выражение) Тогда
			Запрос.УстановитьПараметр(Параметр.Параметр, Параметр.Значение);
		Иначе
			ЗначениеПараметра = Неопределено;
			Выражение = "ЗначениеПараметра = " + Параметр.Выражение + ";";
			Выполнить Выражение;
			Запрос.УстановитьПараметр(Параметр.Параметр, ЗначениеПараметра);
		КонецЕсли;
	КонецЦикла;
	
	//Общие праметры
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	//Для каждого Параметр Из ВходящиеПараметры Цикл
	//	Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	//КонецЦикла;
	
	Если ВыполнитьКакПакет Тогда
		Результат = Запрос.ВыполнитьПакет();
	Иначе
		Результат = Запрос.Выполнить();
	КонецЕсли;
	
	//Результат = РезультатЗапроса.Выбрать();
	
	Возврат Результат;
КонецФункции

#КонецЕсли

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Представление = "Источник " + Данные.Наименование;
КонецПроцедуры

