
Функция ПолучитьДанныеПользователя(ИнфоОПользователе) Экспорт 
	Результат = Web1C_ОбщегоНазначения.ПолучитьПустуюСтруктуруДанныхПользователя();
	
	ОбъектАвторизации = ИнфоОПользователе.ОбъектАвторизации;
	Результат.Вставить("ОбъектАвторизации", ОбъектАвторизации);
	Результат.Вставить("Сессия", ИнфоОПользователе.Сессия);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбъектыАвторизации.Ссылка КАК ОбъектАвторизации,
	|	ОбъектыАвторизации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Web1C_ОбъектыАвторизации КАК ОбъектыАвторизации
	|ГДЕ
	|	ОбъектыАвторизации.Ссылка = &ОбъектАвторизации
	|	И ОбъектыАвторизации.ПометкаУдаления = ЛОЖЬ
	|	И ОбъектыАвторизации.Отключен = ЛОЖЬ";
	Запрос.УстановитьПараметр("ОбъектАвторизации", ОбъектАвторизации);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат.Вставить("ИмяПользователя", Выборка.Наименование);
			Результат.Вставить("Наименование", Выборка.Наименование);
			//Результат.Вставить("Контрагент", Выборка.Контрагент);
			//Результат.Вставить("ВидЦен", Выборка.ВидЦен);
			//Результат.Вставить("Договор", Выборка.Договор);
			//Результат.Вставить("Партнер", Выборка.Партнер);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьМакетБлокаПоИД(ИД) Экспорт 
	Возврат Справочники.Web1C_Компоненты.ПолучитьСсылку(Новый УникальныйИдентификатор(ИД));
КонецФункции


////////////////////////////////////////////////////////////////////////////////
//прочие функции
////////////////////////////////////////////////////////////////////////////////

Функция ЭкранированиеКавычек(Знач Текст) Экспорт 
	Результат = СтрЗаменить(Текст, "", "&quot;");
	
	Возврат Результат;
КонецФункции

Процедура ДополнитьСписокПеременных(СписокПеременных) Экспорт
	//переменные 
	СписокПеременных.Добавить("{#Наименование#}", "Наименование");
	СписокПеременных.Добавить("{#ОбъектАвторизации#}", "Объект авторизации");
	
	//прочее
	//СписокПеременных.Добавить("{}");
	//СписокПеременных.Добавить("{}");
	
КонецПроцедуры

Процедура ДополнитьСписокСсылок(СписокСсылок) Экспорт
	СписокСсылок.Добавить("/{#Имя_Публикации#}/index/order", "Страница заказа");
	СписокСсылок.Добавить("/{#Имя_Публикации#}/index/newOrder", "Страница добавления заказа");
	СписокСсылок.Добавить("/{#Имя_Публикации#}/index/payments", "Страница списка счетов");
	СписокСсылок.Добавить("/{#Имя_Публикации#}/index/payment", "Страница счета");
	СписокСсылок.Добавить("/{#Имя_Публикации#}/index/reports", "Страница списка отчетов");
	СписокСсылок.Добавить("/{#Имя_Публикации#}/index/report", "Страница отчета");
	СписокСсылок.Добавить("/{#Имя_Публикации#}/index/shoppingCart", "Страница корзины");
КонецПроцедуры

