
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
	
	элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	НЗ = РегистрыСведений.Web1C_НастройкиЭкспортаHtmlОбъектов.СоздатьНаборЗаписей();
	НЗ.Очистить();
	НЗ.Записать();
	
	НоваяЗапись = НЗ.Добавить();
	НоваяЗапись.HtmlОбъект = ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Изображения");
	
	НоваяЗапись = НЗ.Добавить();
	НоваяЗапись.HtmlОбъект = ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Скрипты");
	
	НоваяЗапись = НЗ.Добавить();
	НоваяЗапись.HtmlОбъект = ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Стили");
	
	НоваяЗапись = НЗ.Добавить();
	НоваяЗапись.HtmlОбъект = ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Файлы");
	
	НЗ.Записать();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСетевойКаталогНаСервере(Путь)
	МЗ = РегистрыСведений.Web1C_НастройкиЭкспортаHtmlОбъектов.СоздатьМенеджерЗаписи();
	МЗ.HtmlОбъект = ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Изображения");
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		МЗ.СетевойКаталог = Путь + "\img";
		МЗ.Записать();
	КонецЕсли;
	
	МЗ = РегистрыСведений.Web1C_НастройкиЭкспортаHtmlОбъектов.СоздатьМенеджерЗаписи();
	МЗ.HtmlОбъект = ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Скрипты");
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		МЗ.СетевойКаталог = Путь + "\js";
		МЗ.Записать();
	КонецЕсли;
	
	МЗ = РегистрыСведений.Web1C_НастройкиЭкспортаHtmlОбъектов.СоздатьМенеджерЗаписи();
	МЗ.HtmlОбъект = ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Стили");
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		МЗ.СетевойКаталог = Путь + "\css";
		МЗ.Записать();
	КонецЕсли;
	
	МЗ = РегистрыСведений.Web1C_НастройкиЭкспортаHtmlОбъектов.СоздатьМенеджерЗаписи();
	МЗ.HtmlОбъект = ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Файлы");
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		МЗ.СетевойКаталог = Путь + "\files";
		МЗ.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСетевойКаталог(Команда)
	ДопПараметры = Новый Структура("Вариант", 0);
	ОО = Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтотОбъект, ДопПараметры);
	ПоказатьВводСтроки(ОО, "", "Введите сетевой каталог");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПолныйСетевойПутьНаСервере(Путь)
	МЗ = РегистрыСведений.Web1C_НастройкиЭкспортаHtmlОбъектов.СоздатьМенеджерЗаписи();
	МЗ.HtmlОбъект = ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Изображения");
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		МЗ.ПолныйСетевойПуть = Путь + "/img";
		МЗ.Записать();
	КонецЕсли;
	
	МЗ = РегистрыСведений.Web1C_НастройкиЭкспортаHtmlОбъектов.СоздатьМенеджерЗаписи();
	МЗ.HtmlОбъект = ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Скрипты");
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		МЗ.ПолныйСетевойПуть = Путь + "/js";
		МЗ.Записать();
	КонецЕсли;
	
	МЗ = РегистрыСведений.Web1C_НастройкиЭкспортаHtmlОбъектов.СоздатьМенеджерЗаписи();
	МЗ.HtmlОбъект = ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Стили");
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		МЗ.ПолныйСетевойПуть = Путь + "/css";
		МЗ.Записать();
	КонецЕсли;
	
	МЗ = РегистрыСведений.Web1C_НастройкиЭкспортаHtmlОбъектов.СоздатьМенеджерЗаписи();
	МЗ.HtmlОбъект = ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Файлы");
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		МЗ.ПолныйСетевойПуть = Путь + "/files";
		МЗ.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПолныйСетевойПуть(Команда)
	ДопПараметры = Новый Структура("Вариант", 1);
	ОО = Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтотОбъект, ДопПараметры);
	ПоказатьВводСтроки(ОО, "", "Введите полный сетевой путь");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЧастичныйСетевойПутьНаСервере(Путь)
	МЗ = РегистрыСведений.Web1C_НастройкиЭкспортаHtmlОбъектов.СоздатьМенеджерЗаписи();
	МЗ.HtmlОбъект = ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Изображения");
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		МЗ.ЧастичныйСетевойПуть = Путь + "/img";
		МЗ.Записать();
	КонецЕсли;
	
	МЗ = РегистрыСведений.Web1C_НастройкиЭкспортаHtmlОбъектов.СоздатьМенеджерЗаписи();
	МЗ.HtmlОбъект = ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Скрипты");
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		МЗ.ЧастичныйСетевойПуть = Путь + "/js";
		МЗ.Записать();
	КонецЕсли;
	
	МЗ = РегистрыСведений.Web1C_НастройкиЭкспортаHtmlОбъектов.СоздатьМенеджерЗаписи();
	МЗ.HtmlОбъект = ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Стили");
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		МЗ.ЧастичныйСетевойПуть = Путь + "/css";
		МЗ.Записать();
	КонецЕсли;
	
	МЗ = РегистрыСведений.Web1C_НастройкиЭкспортаHtmlОбъектов.СоздатьМенеджерЗаписи();
	МЗ.HtmlОбъект = ПредопределенноеЗначение("Перечисление.Web1C_HTMLОбъекты.Файлы");
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		МЗ.ЧастичныйСетевойПуть = Путь + "/files";
		МЗ.Записать();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьЧастичныйСетевойПуть(Команда)
	ДопПараметры = Новый Структура("Вариант", 2);
	ОО = Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтотОбъект, ДопПараметры);
	ПоказатьВводСтроки(ОО, "", "Введите частичный сетевой путь");
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтроки(Результат, ДопПараметры) Экспорт 
	Если Результат <> Неопределено И Не ПустаяСтрока(Результат) Тогда
		Если ДопПараметры.Вариант = 0 Тогда
			УстановитьСетевойКаталогНаСервере(Результат);
		ИначеЕсли ДопПараметры.Вариант = 1 Тогда
			УстановитьПолныйСетевойПутьНаСервере(Результат);
		ИначеЕсли ДопПараметры.Вариант = 2 Тогда
			УстановитьЧастичныйСетевойПутьНаСервере(Результат);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
